In [1]:
import pandas as pd

In [10]:
user = pd.DataFrame({
    "id": [1,2,3,4,5],
    "name": ['a', 'b', 'c', 'd', 'e']
})

qualifications = pd.DataFrame({
    "user_id": [1,2,3,4,5],
    "qualifications": ["f", 'g', 'h', 'i', 'j']
})

In [5]:
print(user)

   id name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e

In [6]:
print(qualifications)

   user_id qualifications
0        1              f
1        2              g
2        3              h
3        4              i
4        5              j

## Step 5: Merge the two DataFrames

In [7]:
pd.merge(user, qualifications, left_on="id", right_on="user_id")

   id name  user_id qualifications
0   1    a        1              f
1   2    b        2              g
2   3    c        3              h
3   4    d        4              i
4   5    e        5              j

## Step 7: Join two DataFrames

In [8]:
user.join(qualifications)

   id name  user_id qualifications
0   1    a        1              f
1   2    b        2              g
2   3    c        3              h
3   4    d        4              i
4   5    e        5              j

In [9]:
qualifications.join(user)

   user_id qualifications  id name
0        1              f   1    a
1        2              g   2    b
2        3              h   3    c
3        4              i   4    d
4        5              j   5    e

## Step 9: Concatenate three DataFrames by them as a list in pd.concat

In [12]:
pd.concat([user, qualifications])

    id name  user_id qualifications
0  1.0    a      NaN            NaN
1  2.0    b      NaN            NaN
2  3.0    c      NaN            NaN
3  4.0    d      NaN            NaN
4  5.0    e      NaN            NaN
0  NaN  NaN      1.0              f
1  NaN  NaN      2.0              g
2  NaN  NaN      3.0              h
3  NaN  NaN      4.0              i
4  NaN  NaN      5.0              j